app/controllers/reviews_controller.rb

  def show
    @review = Review.find(params[:movie_id])
---
SELECT `reviews`.* FROM `reviews` WHERE `reviews`.`movie_id` IS NULL LIMIT 1